Repository: jackharbon/flutter_mynotes
Catalog: lib/l10n/app_*.arb
Languages: pl

# app_name
source: My Notes
pl: Moje Notatki

# wait
source: Please wait...
pl: Zaczekaj...

source: Cancel
pl: Anuluj

source: Yes
pl: Tak

source: Log Out
pl: Wyloguj

# textField_email_hintText
source: Enter your email here
pl: Wpisz swój email tutaj

# textField_password_labelText
source: Password
pl: Hasło

# textField_password_hintText
source: Enter your password here
pl: Wpisz swoje hasło tutaj

# login_view_appbar_title
source: Login
pl: Logowanie

# login_view_prompt
source: Login to your account to see your notes.
pl: Zaloguj się, by edytować swoje notatki

# login_view_login_button
source: Login
pl: Zaloguj

# login_view_not_registered_yet
source: Not registered yet?
pl: Nie masz konta?

# login_view_register_here
source: Register here
pl: Załóż tutaj

# login_view_forgot_password
source: Forgot password?
pl: Zapomniane hasło?

# login_view_reset_here
source: Reset here
pl: Zresetuj tutaj

# register_view_appbar_title
source: Register
pl: Rejestracja

# register_view_prompt
source: Please register to create your notes.
pl: Załóż konto, żeby tworzyć swoje notatki.

# register_view_internet_prompt
source: Connect to the Internet to register!
pl: Do rejestracji wymagane jest połączenie internetowe!

# register_view_register_button
source: Register
pl: Zarejestruj

# register_view_already_registered
source: Already registered?
pl: Masz już konto?

# register_view_login_here
source: Login here
pl: Zaloguj tutaj

# forgot_password_view_title
source: Reset Password
pl: Resetowanie hasła

# forgot_password_view_prompt
source: If you forgot your password, simply enter your email and we will send you a password reset link.
pl: Jeśli zapomniałeś hasło, podaj swój adres email, a my wyślemy ci link do jego zresetowania.

# forgot_password_view_send_link
source: Send link
pl: Wyślij link

# forgot_password_view_back_to_login
source: Back to login page
pl: Powrót do logowania

# verify_email_view_title
source: Verify Email
pl: Potwierdź email

# verify_email_view_prompt
source: We've sent you an email verification. Please open it and follow the link to verify your account. If you haven't received the email yet, press the button below!
pl: Na twój adres email wysłaliśmy wiadomość z linkiem weryfikującym. Otwórz skrzynkę email i kliknij link w celu potwierdzenia adresu email. Jeżeli nie widzisz tego maila, sprawdź folder SPAM Możesz skorzystać z poniższego przycisku, aby wysłać ponownie link.

# verify_email_view_internet_prompt
source: Connect to the Internet to verify an email!
pl: Połącz z internetem w celu weryfikacji adresu email.

# verify_email_view_notification
source: I am sending a verification email
pl: Wysyłam link weryfikujący email

# verify_email_view_notification_wait
source: I am sending a verification email
pl: Zaczekaj na email wyfikacji adresu email

# verify_email_send_email_again
source: Send again
pl: Wyślij ponownie

# verify_email_already_clicked
source: Already clicked?
pl: Adres potwierdzony?

# verify_email_login_here
source: Login here.
pl: Zaloguj tutaj

# dialog_error_title_login_failed
source: Login Failed!
pl: Logowanie nieudane!

# dialog_error_title_register_failed
source: Register Failed!
pl: Rejestracja nieudana!

# dialog_error_title_password_reset
source: Password Reset
pl: Resetowanie hasła

# dialog_error_missing_credentials
source: Missing credentials! Please check the form fields.
pl: Brakujące dane do logowania! Sprawdź pola formularza.

# dialog_error_invalid_email
source: Invalid email! Please check your email address.
pl: Nieprawidłowy email! Sprawdź wprowadzone dane.

# dialog_error_register_email_in_use
source: Email is already registered! Please login.
pl: Ten email jest już zarejestrowany! Zaloguj.

# dialog_error_user_not_found
source: User not found! Enter correct email or register.
pl: Nie ma takiego użytkownika! Wprowadź poprawny adres email lub zarejestruj.

# dialog_error_wrong_password
source: Wrong password! Please type again.
pl: Błędne hasło! Sprawdź i wprowadź ponownie.

# dialog_error_weak_password
source: Weak password! Please enter a stronger password.
pl: Słabe hasło! Wprowadź mocniejsze hasło.

# dialog_error_login_generic
source: Authentication error! Please try again later.
pl: Błąd autoryzacji! Spróbuj ponownie później.

# dialog_error_register_generic
source: Failed to register. Please try again later!
pl: Rejestracja nieudana!. Spróbuj ponownie później

# dialog_error_occured
source: An error has occurred. Please try again.
pl: Upsss...wystąpił błąd . Spróbuj ponownie później.

# dialog_cannot_share_empty_note_title
source: Sharing
pl: Wysyłanie

# dialog_cannot_share_empty_note_prompt
source: You cannot share empty note! Please add title or note.
pl: Nie możesz wysłać pustej wiadomości! Wprowadź tytuł lub/i treść notatki.

# dialog_delete_note_title
source: Delete note
pl: Usuwanie notatki

# dialog_delete_note_prompt
source: Are you sure you want to delete this note?
pl: Na pewno chcesz usunąć tę notatkę?

# dialog_logout_title
source: Log Out
pl: Wylogowywanie

# dialog_logout_prompt
source: Are you sure you want to log out?
pl: Na pewno chcesz się wylogować?

# dialog_password_reset_title
source: Password Reset
pl: Resetowanie hasła

# dialog_password_reset_prompt
source: We have now sent you a password reset link. Please check your email for more information.
pl: Wysłaliśmy ci email z linkiem do zresetowania hasła. Sprawdź skrzynkę email i postępuj zgodnie z intrukcją.

# dialog_email_verification_title
source: Email Verification
pl: Weryfikacja maila

# dialog_email_verification_prompt
source: Email has been already send. Please wacreate_note_view_textField_hintLabel next request.
pl: Wysłaliśmy ci email. Sprawdź swoją skrzynkę email.

# dialog_no_internet_title
source: No Internet Connection
pl: Brak Internetu

# dialog_no_internet_prompt
source: Please switch on your internet connection to send the email.
pl: Połącz z internetem, żeby zweryfikować email.

# dialog_delete_account_title
source: Warning! Delete Account!
pl: Uwaga! Usuwanie konta

# dialog_delete_account_prompt
source: Are you sure you want to delete your account? You will loose all notes!
pl: Na pewno chcesz usunąć konto? Stracisz wszystkie notatki!

# popup_menu_logout
source: Log Out
pl: Wyloguj

# popup_menu_light_mode
source: Light Mode
pl: Motyw jasny

# popup_menu_system_mode
source: System Mode
pl: Motyw systemu

# popup_menu_dark_mode
source: Dark Mode
pl: Motyw ciemny

# popup_menu_sea_blue
source: Sea Blue
pl: Błękit morski

# popup_menu_hippie_blue
source: Hippie Blue
pl: Niebieski Hippie

# popup_menu_deep_purple
source: Deep Purple
pl: Głęboki fiolet

# popup_menu_purple_brown
source: Purple Brown
pl: Brązowy

# popup_menu_red
source: Red
pl: Czerwony

# popup_menu_pink
source: Pink
pl: Różowy

# popup_menu_gold
source: Gold
pl: Złoty

# popup_menu_green
source: Green
pl: Zielony

# popup_menu_jungle
source: Jungle
pl: Dżungla

# popup_menu_big_stone
source: Big Stone
pl: Stalowy

# popup_menu_delete_account
source: Delete Account
pl: Usuń konto

# create_note_view_title
source: Edit Note
pl: Edycja notatki

# create_note_view_title_textField_labelText
source: Title
pl: Tytuł

# create_note_view_title_textField_hintText
source: Start typing title here...
pl: Zacznij pisać tytuł tutaj..

# create_note_view_note_textField_labelText
source: Note
pl: Notatka

# create_note_view_note_textField_hintText
source: Start typing note here...
pl: Zacznij pisać notatkę tutaj...

# notes_view_title
source: My Notes
pl: Moje notatki

# notes_view_press
source: Press
pl: Naciśnij

# notes_view_to_write
source: to write your first note.
pl: aby utworzyć pierwszą notatkę.

# notes_title
source: {count, plural, =0{No notes yet} =1{1 note} other{{count} notes}}
pl: {count, plural, =0{Brak notatek} =1{1 notatka} few{{count} notatki} other{{count} notatek}}
